incremental-mb/0.3/benchmarks/5000_20_1k_subscriber_added_middle_of_processing.txt
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /notify
Document Length:        0 bytes

Concurrency Level:      20
Time taken for tests:   38.243 seconds
Complete requests:      5000
Failed requests:        0
Total transferred:      375000 bytes
Total body sent:        298025000
HTML transferred:       0 bytes
Requests per second:    130.74 [#/sec] (mean)
Time per request:       152.970 [ms] (mean)
Time per request:       7.649 [ms] (mean, across all concurrent requests)
Transfer rate:          9.58 [Kbytes/sec] received
                        7610.37 kb/s sent
                        7619.94 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.4      0       7
Processing:     2  152 119.1    117    1021
Waiting:        0  152 119.0    117    1021
Total:          5  152 119.1    117    1021

Percentage of the requests served within a certain time (ms)
  50%    117
  66%    119
  75%    123
  80%    128
  90%    230
  95%    338
  98%    672
  99%    841
 100%   1021 (longest request)